---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
VertexStreamPosition Properties
VertexStreamPosition Class See Also Send Feedback
---

The VertexStreamPosition type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from VertexStream.) |

# See Also

VertexStreamPosition Class

Autodesk.Revit.DB.DirectContext3D Namespace